{
  "JointDrillAffix.10001.1": "Symphony: Sigh",
  "JointDrillAffix.10001.2": "The boss gains an Echo Codex that dissipates after taking a certain number of hits. When the boss casts certain skills, the Echo Codex casts similar skills.",
  "JointDrillAffix.10002.1": "Symphony: Recitation",
  "JointDrillAffix.10002.2": "The boss gains a Record Codex that dissipates after taking a certain number of hits but revives after some time. When the boss casts certain skills, the Record Codex records similar skills and cast them later.",
  "JointDrillAffix.10003.1": "Codex's Protection",
  "JointDrillAffix.10003.2": "The boss initially has high DMG Resistance. Each Echo Codex or Record Codex removed lowers the boss's DMG Resistance.",
  "JointDrillAffix.10004.1": "Symphony: Fear Resonance",
  "JointDrillAffix.10004.2": "Each time a friendly unit deals DMG to the boss, increases the boss's DMG Taken for a short period.",
  "JointDrillAffix.10005.1": "Requiem Aria",
  "JointDrillAffix.10005.2": "The boss summons multiple Echo Codices to continuously channel energy. The fewer Echo Codices remaining when the channeling ends, the weaker the attacks from the boss.",
  "JointDrillAffix.10006.1": "Nightmare Finale",
  "JointDrillAffix.10006.2": "The boss summons the Record Codices on the battlefield and absorbs them. The more Record Codices absorbed, the stronger the boss's attacks will become.",
  "JointDrillAffix.10007.1": "Waltz: Chorus",
  "JointDrillAffix.10007.2": "The boss gains an Echo Codex that takes much less Auto ATK DMG. When the boss casts certain skills, the Echo Codex casts similar skills.",
  "JointDrillAffix.10008.1": "Waltz: Echo",
  "JointDrillAffix.10008.2": "The boss gains a Record Codex that takes much less Auto ATK DMG and revives after some time. When the boss casts certain skills, the Record Codex records similar skills and casts them later.",
  "JointDrillAffix.10009.1": "Waltz: Malice Shroud",
  "JointDrillAffix.10009.2": "After a friendly unit deals damage to the boss a certain number of times, it increases the damage the boss takes for a short period."
}