{
  "MiningTreasure.1001.1": "Bronze Coin",
  "MiningTreasure.1001.2": "As sand is brushed away, time stands still.",
  "MiningTreasure.1002.1": "Freshwater Pearl",
  "MiningTreasure.1002.2": "Beneath its pure luster lies a heart of utmost sincerity.",
  "MiningTreasure.1003.1": "Ocean Coral",
  "MiningTreasure.1003.2": "A frozen wave, a silent song of the ocean.",
  "MiningTreasure.1201.1": "Puppet Fragment",
  "MiningTreasure.1201.2": "A relic from an ancient kingdom, fragments of its iron-bound body now buried in the soil.",
  "MiningTreasure.1202.1": "Brass Gear",
  "MiningTreasure.1202.2": "A relic from an ancient kingdom. In the fine, intricate details of the gear, one can almost glimpse the brilliance of the civilization that forged it.",
  "MiningTreasure.1203.1": "Scorched Core",
  "MiningTreasure.1203.2": "The puppet-making craft has long been lost. But with a core like this, perhaps one day one could recreate it...",
  "MiningTreasure.1301.1": "Coin",
  "MiningTreasure.1301.2": "A Ritual of Mysterious Origin: Tossing a coin into the greenhouse is said to boost the approval rate for project proposals.",
  "MiningTreasure.1302.1": "Bundle of Dorras",
  "MiningTreasure.1302.2": "Coins just weren't enough anymore. Employees seem convinced that tossing larger bundles of cash guarantees their proposals will be accepted.",
  "MiningTreasure.1303.1": "Coin Purse",
  "MiningTreasure.1303.2": "Company Notice: Stop wasting money on superstitions. Buy some Pep Pep Juice and put in some honest overtime instead.",
  "MiningTreasure.2001.1": "Glopo Crystal",
  "MiningTreasure.2001.2": "The most adorable monster crystal in the world.",
  "MiningTreasure.2002.1": "Jar Spirit Fragrance",
  "MiningTreasure.2002.2": "A single drop grants understanding of all elvish tongues.",
  "MiningTreasure.2003.1": "Sharky Scepter",
  "MiningTreasure.2003.2": "The bearer of the scepter rides the waves and commands the shark packs.",
  "MiningTreasure.2201.1": "Corroded Compass",
  "MiningTreasure.2201.2": "Once belonged to an adventurer, this lost item has been weathered by sun and wind, leaving the hands mottled with rust.",
  "MiningTreasure.2202.1": "Hand-Drawn Map",
  "MiningTreasure.2202.2": "Once belonged to an adventurer, this lost fragment bears only faint, worn traces of its original markings.",
  "MiningTreasure.2203.1": "Lapis Pocket Watch",
  "MiningTreasure.2203.2": "Once belonged to an adventurer, this lost pocket watch is engraved with constellations across its dial. It is beautifully crafted and remarkably well preserved.",
  "MiningTreasure.2301.1": "Rock",
  "MiningTreasure.2301.2": "A generic rock found all over the greenhouse. It's a notorious tripping hazard for employees rushing to clock in on time.",
  "MiningTreasure.2302.1": "Crushed Drink Can",
  "MiningTreasure.2302.2": "An empty can tossed carelessly aside. The Greenhouse Manager has filed countless complaints about this litter.",
  "MiningTreasure.2303.1": "Dirty Sherlock Plushie",
  "MiningTreasure.2303.2": "Announcement: Littering is strictly prohibited. It is everyone's duty to uphold the company's image.",
  "MiningTreasure.3001.1": "Muddy Leather Bag",
  "MiningTreasure.3001.2": "Beneath its filthy surface lurks unsettling secrets.",
  "MiningTreasure.3002.1": "Skeleton Key",
  "MiningTreasure.3002.2": "Is it the source of all disasters or the dawn of supreme glory?",
  "MiningTreasure.3003.1": "Ancient Sea Scroll",
  "MiningTreasure.3003.2": "Lost in the sea of time, it writes an eternal forbidden spell of the unknown.",
  "MiningTreasure.3201.1": "Withered Vines",
  "MiningTreasure.3201.2": "Rotten vines. Once useful for weaving tools, they are now fairly worthless.",
  "MiningTreasure.3202.1": "Old Tree Stump",
  "MiningTreasure.3202.2": "The remnant of a felled old tree. Once polished and painted, it can be used as garden or indoor decorative piece.",
  "MiningTreasure.3203.1": "Butterfly in Amber",
  "MiningTreasure.3203.2": "A resin sphere with a butterfly inside it. Placed under light, it glows brilliantly—an artwork shaped entirely by nature.",
  "MiningTreasure.3301.1": "Greenhouse Key",
  "MiningTreasure.3301.2": "A key dropped by a careless employee. They used its loss as an excuse to play hooky the next day.",
  "MiningTreasure.3302.1": "Earth Drill",
  "MiningTreasure.3302.2": "An earth drill left behind by an absent-minded employee from R&D. The entire department tried to find it the next day but failed.",
  "MiningTreasure.3303.1": "Plant Support Stake",
  "MiningTreasure.3303.2": "A stake forgotten by a distracted Greenhouse Manager. The plant had somehow been propped up already the next day.",
  "MiningTreasure.4001.1": "Black Clay Pot",
  "MiningTreasure.4001.2": "Though coarse and heavy, it stands as the sturdiest fortress.",
  "MiningTreasure.4002.1": "White Jade Box",
  "MiningTreasure.4002.2": "The moment it sees daylight again, everyone is astonished by its crystalline brilliance.",
  "MiningTreasure.4003.1": "Dragon Scale Chest",
  "MiningTreasure.4003.2": "Legend says only those who vanquish the dragon are worthy of this extraordinary treasure.",
  "MiningTreasure.4201.1": "Pine-Resin Torch",
  "MiningTreasure.4201.2": "A bark torch soaked in resin, now too damp to serve its original purpose.",
  "MiningTreasure.4202.1": "Mossy Lantern",
  "MiningTreasure.4202.2": "The lantern's glass surface is covered in moss stains and cracks, but all it needs is a new wick to work again.",
  "MiningTreasure.4203.1": "Everlasting Lamp",
  "MiningTreasure.4203.2": "A rare oil lamp said to burn for centuries. A true treasure for adventurers.",
  "MiningTreasure.4301.1": "Watering Can",
  "MiningTreasure.4301.2": "A Greenhouse Ghost Story: In the dead of night, the sound of splashing water echoes from greenhouses that should be empty.",
  "MiningTreasure.4302.1": "Grow Light",
  "MiningTreasure.4302.2": "A Greenhouse Ghost Story: In the dead of night, faint lights can be seen flickering inside greenhouses that should be empty.",
  "MiningTreasure.4303.1": "Vegetable Seeds",
  "MiningTreasure.4303.2": "It turns out a Manager was just growing vegetables for their own table. They have since been publicly reprimanded."
}